//==============================================================================================
/*!
	@file  wr.h(window resource header)

	@author kanemura
*/
//==============================================================================================
#pragma once

#define	DEFAULT_NAME	000_000_00002
#define	DEFAULT_TEXTURE	100_000_00001
//==============================================================================================
/*!
	@brief	define WINDOW STYLE
	@note	
*/
//==============================================================================================

// 位置を設定するスタイル
//--------------------------------------------
//ANCHOR_DEFAULT
//ANCHOR_LEFTTOP		ウィンドウの基準位置が画面の左上.
//ANCHOR_LEFT			ウィンドウの基準位置が画面の左中.
//ANCHOR_LEFTBOTTOM		ウィンドウの基準位置が画面の左下.
//ANCHOR_TOP			ウィンドウの基準位置が画面の上部.
//ANCHOR_CENTER			ウィンドウの基準位置が画面中央.
//ANCHOR_BOTTOM			ウィンドウの基準位置が画面の底部.
//ANCHOR_RIGHTTOP		ウィンドウの基準位置が画面の右上.
//ANCHOR_RIGHT			ウィンドウの基準位置が画面の右中.
//ANCHOR_RIGHTBOTTOM	ウィンドウの基準位置が画面の右底.

// 優先度タイプ
//--------------------------------------------
//TOP			最優先ウィンドウとなるが、他のウィンドウの機能は奪わない
//POPUP 		ポップアップウィンドウ、自分以外のウィンドウの機能を奪う
//TOPMOST 		ポップアップウィンドウ、自分以外のウィンドウの機能を奪う
//NOECLIPSE		ウィンドウが開いたときに他のウィンドウを暗くしない(TOP/POPUP時のみ有効).

// ウィンドウフレーム関連.
//--------------------------------------------
//NOCLOSE 			ユーザーが閉じれない（閉じるボタン無し、ＥＳＣキー無効）
//NOMINIMIZATION 	最小化できない
//NOHELP 			ヘルプボタンが必要ない
//NOTITLEBAR		タイトルバー無し
//FRAME				タイトルバー無し
//NOFRAME			フレームの表示をオフにする

// ウィンドウ機能制御関連
//--------------------------------------------
//DISABLE 		機能を奪う
//DRAG			ドラッグ可
//NOACTIVE		アクティブにならない
//HIDE 			非表示
//NOBRINGTOTOP	アクティブになった時に全面にでない
//OPENBOTTOM	プライオリティが一番下になるように開く

//==============================================================================================
/*!
	@brief	define CTRL STYLE
	@note	
*/
//==============================================================================================
// 原点を決定するスタイル.
//--------------------------------------------
//ANCHOR_DEFAULT		原点がデフォルト(左上).
//ANCHOR_LEFTTOP		原点が左上.
//ANCHOR_LEFT			原点が左中.
//ANCHOR_LEFTBOTTOM		原点が左下.
//ANCHOR_TOP			原点が上部.
//ANCHOR_CENTER			原点が中央.
//ANCHOR_BOTTOM			原点が底部.
//ANCHOR_RIGHTTOP		原点が右上.
//ANCHOR_RIGHT			原点が右中.
//ANCHOR_RIGHTBOTTOM	原点が右底.

// 基準位置を決定するスタイル
//--------------------------------------------
//BASE_DEFAULT			基準位置がデフォルト(WIN_CTRL_STYLE_ANCHOR_を継承).
//BASE_LEFTTOP			基準位置が左上.
//BASE_LEFT				基準位置が左中.
//BASE_LEFTBOTTOM		基準位置が左下.
//BASE_TOP				基準位置が上部.
//BASE_CENTER			基準位置が中央.
//BASE_BOTTOM			基準位置が底部.
//BASE_RIGHTTOP			基準位置が右上.
//BASE_RIGHT			基準位置が右中.
//BASE_RIGHTBOTTOM		基準位置が右底.

// テキスト位置を設定するスタイル(ボタンで有効)
//--------------------------------------------
//TEXT_NONE 	テキスト表示を指定せずデフォルトにする.
//TEXT_LEFT 	テキストを左詰めで表示する
//TEXT_CENTER 	テキストをセンタリング表示する
//TEXT_RIGHT 	テキストを右詰めで表示する

// テキストスタイルを設定する
//--------------------------------------------
//TEXT_NORMAL 		通常表示
//TEXT_BOLD 		太字
//TEXT_DENT 		凹み
//TEXT_SHADOW 		影付き

//機能を制限するスタイル
//--------------------------------------------
//HIDE 		非表示
//DRAG 		ドラッグ
//DISABLE 	機能を奪う(色も暗くする)
//NOHIT		マウスの当たり判定無し

//その他
//--------------------------------------------
//EDIT_BLIND 						ブラインド入力スタイル
//EDIT_TYPE_ALL 					デフォルト.
//EDIT_TYPE_ASCIICAPABLE 			ASCII配列のキーボード.
//EDIT_TYPE_NUMBERANDPUNCTUATION 	数字と句読点が含まれるキーボード.
//EDIT_TYPE_URL				 		URL入力を行うキーボード.
//EDIT_TYPE_NUMBERPAD 				PINの入力用にデザインされたテンキーキーボード.
//EDIT_TYPE_PHONEPAD 				電話番号入力を行うキーボード.
//EDIT_TYPE_NAMEPHONEPAD			番号入力と文字入力を行うキーボード.
//EDIT_TYPE_EMAILADDRESS			メールアドレスを入力するキーボード.

//NOBOUNCES			スクロール時、領域外で跳ねる処理をしない

//ITEM_STACK_V		縦スクロール.
//ITEM_STACK_H		横スクロール.
//SCROLL_UNLOCK		リストボックスのスクロールをロックしない.
//SCROLL_LOCK		リストボックスのスクロールをロックする.

//SCROLLBAR_DISPLAY_NORMAL		最小限表示(デフォルト).
//SCROLLBAR_DISPLAY_SCROLLABLE	スクロール可能なとき表示.
//SCROLLBAR_DISPLAY_ALWAYS		常に表示.

//==============================================================================================
/*!
	@brief	相対サイズを作るためのマクロ.
	@note	
*/
//==============================================================================================
#define	RELATIVE_SIZE(_size_)	{100} + (_size_)

//==============================================================================================
/*!
	@brief	0～255でカラーを作るためのマクロ.
	@note	
*/
//==============================================================================================
#define	COLOR32(_r,_g,_b,_a)	(_r)/255.0,(_g)/255.0,(_b)/255.0,(_a)/255.0

//==============================================================================================
/*!
	@brief	システムウィンドウ系の出力先
	@note	
*/
//==============================================================================================
#define	SYSTEM_WINDOW_PATH	"Assets/KsSoft/Plugins/Window/SystemWindow/"
